UKS/src/DataProcessors/ВводОтпечатныхЛистовСписком/ВводОтпечатныхЛистовСписком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВводОтпечатныхЛистовСписком</name>
  <comment>Ввод отпечатаных листов списком</comment>
  <attributes>
    <name>ДатаВвода</name>
    <comment>Дата ввода</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <comment>Оборудование</comment>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмерЛиста</name>
      <comment>Размер листа</comment>
      <type>
        <types>EnumRef.РазмерыЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветПечати</name>
      <comment>Цвет печати</comment>
      <type>
        <types>EnumRef.ЦветПечати</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтпечатанных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресОборудования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <comment>Размещение</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <comment>Изготовитель</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

UKS/src/InformationRegisters/ЖурналОтпечатаныхЛистов/ЖурналОтпечатаныхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтпечатаныхЛистов</name>
  <comment>Журнал отпечатаных листов</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОтпечатанных</name>
    <comment>Количество</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазмерЛиста</name>
    <comment>Размер листа</comment>
    <type>
      <types>EnumRef.РазмерыЛиста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦветПечати</name>
    <type>
      <types>EnumRef.ЦветПечати</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UKS/src/Documents/ОборудорваниеДляОтпечатаныхЛистов/ОборудорваниеДляОтпечатаныхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОборудорваниеДляОтпечатаныхЛистов</name>
  <comment>Список оборудования для отпечатаных листов</comment>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <comment>Оборудование</comment>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмерЛиста</name>
      <comment>Размер листа</comment>
      <type>
        <types>EnumRef.РазмерыЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветПечати</name>
      <comment>Цвет печати</comment>
      <type>
        <types>EnumRef.ЦветПечати</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UKS/src/DataProcessors/ВводОтпечатныхЛистовСписком/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаВвода = НачалоДня(ТекущаяДата());
	
	ЗаполнитьОборудование();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОборудование()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОборудорваниеДляОтпечатаныхЛистов.Проведен КАК Проведен,
		|	ОборудорваниеДляОтпечатаныхЛистов.Дата КАК Дата,
		|	ОборудорваниеДляОтпечатаныхЛистов.СписокОборудования.(
		|		Оборудование КАК Оборудование,
		|		РазмерЛиста КАК РазмерЛиста,
		|		ЦветПечати КАК ЦветПечати
		|	) КАК СписокОборудования
		|ИЗ
		|	Документ.ОборудорваниеДляОтпечатаныхЛистов КАК ОборудорваниеДляОтпечатаныхЛистов
		|ГДЕ
		|	ОборудорваниеДляОтпечатаныхЛистов.Проведен = ИСТИНА
		|	И ОборудорваниеДляОтпечатаныхЛистов.Дата <= &ДатаВвода";
	
	Запрос.УстановитьПараметр("ДатаВвода",Объект.ДатаВвода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОБъект.СписокОборудования.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВыборкаСписокОборудования = ВыборкаДетальныеЗаписи.СписокОборудования.Выбрать();
		Пока ВыборкаСписокОборудования.Следующий() Цикл 
			НоваяСтрока = Объект.СписокОборудования.Добавить();	
			НоваяСтрока.Оборудование = ВыборкаСписокОборудования.Оборудование;
			НоваяСтрока.Размещение = ВыборкаСписокОборудования.Оборудование.Размещение;
			НоваяСтрока.Изготовитель = ВыборкаСписокОборудования.Оборудование.Изготовитель;
			НоваяСтрока.АдресОборудования = ВыборкаСписокОборудования.Оборудование.ИПАдрес;
			НоваяСтрока.РазмерЛиста = ВыборкаСписокОборудования.РазмерЛиста;
			НоваяСтрока.ЦветПечати = ВыборкаСписокОборудования.ЦветПечати;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьОборудование()

&НаКлиенте
Процедура СписокОборудованияАдресОборудованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке("http://"+СокрЛП(Элемент));

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОборудованиеНаКлиенте(Команда)
	
	ЗаполнитьОборудование();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписиНаСервере()
	
	Если Объект.СписокОборудования.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЖурналОтпечатаныхЛистов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Объект.ДатаВвода);
	Для Каждого СтрокаТаблицыОборудование Из Объект.СписокОборудования Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Период = Объект.ДатаВвода;
		Запись.Оборудование = СтрокаТаблицыОборудование.Оборудование;
		Запись.РазмерЛиста = СтрокаТаблицыОборудование.РазмерЛиста;
		Запись.ЦветПечати = СтрокаТаблицыОборудование.ЦветПечати;
		Запись.КоличествоОтпечатанных = СтрокаТаблицыОборудование.КоличествоОтпечатанных;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписи(Команда)
	
	СоздатьЗаписиНаСервере();
	Сообщить("Создано записей "+Объект.СписокОборудования.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОборудованияАдресОборудованияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокОборудованияАдресОборудования" Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке("http://"+СокрЛП(Элемент.ТекущиеДанные.АдресОборудования));	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиНаСервере()
	
	НаборЗаписей = РегистрыСведений.ЖурналОтпечатаныхЛистов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Объект.ДатаВвода);
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписи(Команда)
	УдалитьЗаписиНаСервере();
КонецПроцедуры
